import React from "react";

import * as S from "./style";

type UserData = Array<{
  수험번호: number;
  성명: string;
  출신중학교: string;
  지역: string;
  전형유형: string;
  접수번호: number;
}>;

interface OwnProps {
  userData: UserData[];
}

const ATestTicket = () => {
  // test는 props로 받아서 사용하세요.
  // text의 데이터 포맷은 interface로 지정해두었습니다.
  // interface의 변수명은 서버에서 받아오는 데이터에 맞도록 수정하세요.
  // Props Type 적용하고 아래의 test대신에 props로 받아온 변수를 map함수 돌리면됩니다.
  // 힘내용 ♥ 히히

  const test = [
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ],
    [
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109
      },
      {
        a: 12026,
        b: "이우찬",
        c: "전주해성중학교",
        d: "전국",
        e: "일반전형",
        f: 109,
        g: "blobData"
      }
    ]
  ];

  const printOrder = () => {
    const printableElements = document.getElementById("printDiv").innerHTML;
    const orderHtml = `<html><head><title></title></head><body>${printableElements}</body></html>`;
    const oldPage = document.body.innerHTML;
    document.body.innerHTML = orderHtml;
    window.print();
    document.body.innerHTML = oldPage;
  };

  return (
    <>
      <S.printButton onClick={printOrder}>프린트</S.printButton>
      <S.printDiv id="printDiv">
        {test.map((value, index) => (
          <S.Page key={index}>
            {value.map((data, index) => (
              <S.TicketBody key={index}>
                <div>
                  <p>2019학년도 대덕소프트웨어마이스터고등학교</p>
                  <p className="big">입학전형 수험표</p>
                </div>
                <div className="tickeyBody">
                  <img src={data.g} alt="사용자 이미지" />
                  <table>
                    <tbody>
                      <tr>
                        <td>수험번호</td>
                        <td className="n_br">{data.a}</td>
                      </tr>
                      <tr>
                        <td>성명</td>
                        <td className="n_br">{data.b}</td>
                      </tr>
                      <tr>
                        <td>출신중학교</td>
                        <td className="n_br">{data.c}</td>
                      </tr>
                      <tr>
                        <td>지역</td>
                        <td className="n_br">{data.d}</td>
                      </tr>
                      <tr>
                        <td>전형유형</td>
                        <td className="n_br">{data.e}</td>
                      </tr>
                      <tr>
                        <td className="last">접수번호</td>
                        <td className="last n_br">{data.f}</td>
                      </tr>
                    </tbody>
                  </table>
                </div>
                <div>
                  <p className="big foot">대덕소프트웨어마이스터고등학교장</p>
                </div>
              </S.TicketBody>
            ))}
          </S.Page>
        ))}
      </S.printDiv>
    </>
  );
};

export default ATestTicket;
