import * as React from "react";
import { Component } from "react";

import * as S from "./style";

class DocumentContainer extends React.Component {
  render() {
    return (
      <>
        <S.DocumentSelectBar>
          <ul>
            <S.DocumentSelectItem>
              자기소개서 <S.SelectUnderline />
            </S.DocumentSelectItem>
            <S.DocumentSelectItem>
              학업계획서
              <S.SelectUnderline />
            </S.DocumentSelectItem>
          </ul>
        </S.DocumentSelectBar>
        <S.DocumentContainer>
          안녕하세요, 저는 OOO 입니다. 저의 자기소개서에는 어떤 것 어떤 것 어떤
          것 등이 담겨있습니다. 제가 하고싶은 말은 그렇기 때문에 어쩌구저쩌구
          아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구 저쩌구…. 등등 헛소리를
          하려고 합니다. 저는 OOO 입니다. 저의 자기소개서에는 어떤 것 어떤 것
          어떤 것 등이 담겨있습니다. 제가 하고싶은 말은 그렇기 때문에
          어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구 저쩌구…. 등등
          헛소리를 하려고 합니다. 제가 하고싶은 말은 그렇기 때문에 어쩌구저쩌구
          아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구 저쩌구…. 등등 헛소리를
          하려고 합니다. 저는 OOO 입니다. 저의 자기소개서에는 어떤 것 어떤 것
          어떤 것 등이 담겨있습니다. 제가 하고싶은 말은 그렇기 때문에
          어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구 저쩌구…. 등등
          헛소리를 하려고 합니다. 제가 하고싶은 말은 그렇기 때문에 어쩌구저쩌구
          아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구 저쩌구…. 등등 헛소리를
          하려고 합니다. 저는 OOO 입니다. 저의 자기소개서에는 어떤 것 어떤 것
          어떤 것 등이 담겨있습니다. 제가 하고싶은 말은 그렇기 때문에
          어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구 저쩌구…. 등등
          헛소리를 하려고 합니다. 제가 하고싶은 말은 그렇기 때문에 어쩌구저쩌구
          아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구 저쩌구…. 등등 헛소리를
          하려고 합니다. 저는 OOO 입니다. 저의 자기소개서에는 어떤 것 어떤 것
          어떤 것 등이 담겨있습니다. 제가 하고싶은 말은 그렇기 때문에
          어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구 저쩌구…. 등등
          헛소리를 하려고 합니다. . 안녕하세요, 저는 OOO 입니다. 저의
          자기소개서에는 어떤 것 어떤 것 어떤 것 등이 담겨있습니다. 제가
          하고싶은 말은 그렇기 때문에 어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기
          때문에 어짜구 저쩌구…. 등등 헛소리를 하려고 합니다. 저는 OOO 입니다.
          저의 자기소개서에는 어떤 것 어떤 것 어떤 것 등이 담겨있습니다. 제가
          하고싶은 말은 그렇기 때문에 어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기
          때문에 어짜구 저쩌구…. 등등 헛소리를 하려고 합니다. 제가 하고싶은 말은
          그렇기 때문에 어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구
          저쩌구…. 등등 헛소리를 하려고 합니다. 저는 OOO 입니다. 저의
          자기소개서에는 어떤 것 어떤 것 어떤 것 등이 담겨있습니다. 제가
          하고싶은 말은 그렇기 때문에 어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기
          때문에 어짜구 저쩌구…. 등등 헛소리를 하려고 합니다. 제가 하고싶은 말은
          그렇기 때문에 어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구
          저쩌구…. 등등 헛소리를 하려고 합니다. 저는 OOO 입니다. 저의
          자기소개서에는 어떤 것 어떤 것 어떤 것 등이 담겨있습니다. 제가
          하고싶은 말은 그렇기 때문에 어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기
          때문에 어짜구 저쩌구…. 등등 헛소리를 하려고 합니다. 제가 하고싶은 말은
          그렇기 때문에 어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기 때문에 어짜구
          저쩌구…. 등등 헛소리를 하려고 합니다. 저는 OOO 입니다. 저의
          자기소개서에는 어떤 것 어떤 것 어떤 것 등이 담겨있습니다. 제가
          하고싶은 말은 그렇기 때문에 어쩌구저쩌구 아울러서 어쩌구 저쩌구 그렇기
          때문에 어짜구 저쩌구…. 등등 헛소리를 하려고 합니다. .
        </S.DocumentContainer>
      </>
    );
  }
}

export default DocumentContainer;
